# GetVisibility Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePoint..::..GetVisibility Method
ReferencePoint Class See Also
---
Gets the visibility for the point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyElementVisibility GetVisibility()
```

Visual Basic
---
```text
Public Function GetVisibility As FamilyElementVisibility
```

Visual C++
---
```text
public:
FamilyElementVisibility^ GetVisibility()
```

# ### Return Value
A copy of visibility settings for the ReferencePoint.
# See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace